/**
 * 组件
 * 请避免js开发中出现与组件名称相同的变量
 */
const footerSecurity = {
    cache: {},
    template: `
    <div>
    <div class="content">
        <div class="header-block"></div><!-- 导航栏占位符 -->
      <div class="main">
          <!-- content-nav start -->
          <div class="content-nav footer-nav-content">
              <p>
                  <span>首页</span> >
                  <span>安全与隐私</span>
              </p>
          </div>
          <!-- conent-nav end -->

          <div class="title">
              <h3>隐私政策</h3>
          </div>

          <!-- word-space start -->
          <div class="word-space">
              <h4>隐私权保护政策</h4>
              <pre>
你的隐私对minorité小众之地（以下称“我们”）而言至关重要。因此我们将非常谨慎而合理地使用和分享您的相关信息。本隐私权保护政策意在帮助您了解我们是如何收集、使用以及安全存储您提供的个人信息，请您务必仔细阅读。通过访问本网站，我们视为您已经同意了本隐私权保护政策中的条款及我们对该些条款随时的修订。<br />
通过浏览我们拥有和营运的任何网站（包括www.minorité.com.cn、www.minorité.shop等，合称我们的“网站”），或者通过其他方式向我们提供您的个人资料（包括通过到访我们的实体店、与在线客服咨询，或通过申请或享用例如会员贵宾卡或会员特卖活动等服务）即表示您确认和同意，我们将根据该不时修订的隐私政策收集、使用、储存和披露您的个人资料。本隐私政策纳入我们的服务条款，并构成其组成部分。<br />
我们会定期审视本隐私政策，并且不时地通过更新本网页来修订隐私政策的规定。您在本隐私政策修改后继续使用我们的服务，即表示同意本经修订的隐私政策，因此，请定期浏览本网页，以便取得隐私政策的最新资料。<br />
              </pre>
              <h4>我们收集哪些信息？</h4>
              <pre>
我们收集、使用和储存您的个人资料，以确保我们可以在网上及实体店向您提供各种服务并建立个人化的购物体验。这些行为可能通过我们的网站或其他方式发生。我们会在任何时候根据本隐私政策将您的个人资料保密，并且仅根据本隐私政策收集、使用、储存和披露上述资料。<br />

我们可在我们的网站以及包括我们的专卖店在内的实体店，在不同范围内收集您的个人资料 ：<br />
•  您在我们的网站上注册时，将需要输入您的某些个人资料（例如您的姓名和联系方式），以便享用我们向注册用户提供的各项功能和服务（例如电邮更新或对您的查询作出回馈）并参与我们的会员特卖活动。<br />
•  您还可以使用我们网站上运行的其他社交网络功能、Widgets及／或小型互动程式。这些功能是些小的内容模块，可以收集个人资料，包括您的IP地址、您在我们网站上浏览的网页，或设置Cookie让功能可以妥善运作。这些社交网络功能由我们或第三方在我们网站上设置。如果功能是由第三方提供，则对您的个人资料的使用将受该第三方的隐私政策的规管，因此请审阅该等第三方的隐私政策。<br />
              </pre>
              <h4>我们如何使用这些信息？</h4>
              <pre>
我们会为下述目的（以及与该等目的直接相关的任何目的）（合称“有关目的”），使用您向我们提供的个人资料：<br />
•  向您提供我们的服务（包括评估该等服务的任何申请及管理该等服务）。这包括对您可能提出的任何问题作出回应、向您提供店内及网站上产品的建议、保留您在网站上选择的购物车、就您申请我们的任何服务进行评估、向您发放我们的会员积分、允许您参与所想参与的推广及活动，并且履行您向我们下达的订单（包括对您的资料进行核实和安全检查，并且处理您的付款）。<br />
•  分析趋势、使用情况和与我们的购物行为（包括个人或集体层面），这有助于我们更好地了解您以及广v大客户群访问和使用我们的网站以及获取并使用我们的服务的方式，以便完善我们的服务，并且对客户的需要和喜好做出回应。为了这些目的，我们会使用您的性别、年龄、兴趣、所在地、网站使用情况、购物习惯及其他个人资料。<br />
•  如果您不向我们提供您的个人资料，我们可能无法向您提供某些服务和功能。<br />
•  您可能会不时向我们提供第三方的个人资料（例如：您为了取得我们提供的优惠）。您同意，您在提供第三方的个人资料前，已取得有关第三方同意向我们提供该等资料（供以根据本隐私政策收集、使用、储存和披露）。<br />
•  如果您（不论是作为访客还是注册用户）正在浏览我们的网站，网站可能会在您的计算机或移动装置上置入cookies，这将帮助我们识别您的装置，以便为您建立个人化的购物体验并提供各种服务（例如保留您购物车选项等）。Cookies是储存于您的硬盘或装置内的小型资料档案，大部分的浏览器均自动接受这些档案。这并不允许我们接入您的装置的其他部分或查阅您的个人资料。如果您不希望接受cookies，请变更您的浏览器的设置。请注意，如果您的浏览器不接受cookies，您可能无法享用我们在网站上提供的所有功能和服务。营销信息<br />
我们将在网站上的适当位置设置用以打钩的选项框，您可以在选项框内打钩以同意接收我们的直接营销信息。如果您同意，我们可以根据下述条款以及本隐私政策的其余规定利用您提供给我们的个人资料不时向您进行发出直接营销信息： 我们可能会向您营销我们的商品和服务，以及：(a) 我们的相关公司（包括我们的关联公司及子公司），(b) 合营伙伴，和(c)其他第三方提供商的商品和服务。上述的营销信息形式不限，包括广告、特别活动通告或简讯，并且按照您提供给我们的个人资料以例如电邮、短讯、 智能手机应用程式推送 、社交媒体的通知、应用程序内信息及邮件等多种方式交付。
              </pre>
              <h4>您的资料安全和保护</h4>
              <pre>
我们将采取合理的实体、电子和管理措施保护您向我们提供的个人资料。但是，由于互联网固有的作为公开的全球性的沟通工具的自然特性，我们不能保证这些信息将绝对的安全并不受其他方如电脑黑客的侵害。任何没有经我们授权或许可的对网站或所收集、留存信息的访问或使用将立刻被我们引以注意并通过相电脑监控程序被获知并记录。我们将调查，并在必要时采取法律途径来保护本隐私权保护政策或阻止对该政策的违反。<br />
请注意，不要在聊天室或通过语音聊天，或在信息版中披露自己的个人信息。您无论何时披露，所有信息将可能被其他人收集或使用。如果您在公众地区登载了您的个人信息，其他人将可能对您发出并非您期待的电子邮件信息。请对您的个人信息小心并巧妙的保管。minorité网站对于您在前述任何公众地区登载、披露、上传或以其它非本网站合法要求的方式透露的信息的安全性不承担任何责任。<br />
在您使用我们的网站时，为了保护您的个人资料，我们将利用SSL技术将您通过我们的网站传送给我们的任何个人资料加密，这一技术是互联网上加密措施的行业标准。<br />
本隐私政策规定并不限制您所享有适用法律规定不能限制的权利。
              </pre>
              <h4>您个人资料的披露</h4>
              <pre>
我们会将所持有的关于您的个人资料保密，但我们可以向下述各方（其可能位于中华人民共和国以外地方，并且在中华人民共和国以外地方使用您的个人资料）披露您的个人资料：<br />
•  向(a) 我们任何相关公司（包括我们的关联公司和子公司）或(b)代表我们或者与我们共同行事的任何人士或公司 或(c)我们网站上功能的任何服务提供商作出披露；以上情况均在于达成有关目的，但前提是，各方均须遵守实质性地相当于本隐私政策载列的保密和隐私义务；<br />
•  如果是就您所要求的产品和服务建立和支持付款设施所需的，向任何金融机构、记帐卡或信用卡发卡公司、信贷资料或参考机构或者托收机构作出披露；<br />
•  若根据法定或合同义务，或者按照法律或法院规定，被强制作出上述披露，或者是（经法律允许）有必要作出上述披露以保护我们利益，向任何其他方作出披露。<br />
除非已事先取得您的明确同意，否则我们不会向任何其他第三方提供您的个人资料。我们可以不时向第三方传送匿名的汇总数据，其中可能包括以匿名格式存在的您的个人资料，而且该等数据并不以任何方式（在我们网站上除外）使得第三方可以识别您的身份。<br />
本隐私政策对我们及本网站适用，但并不适用于任何其他第三方（包括第三方维护的任何网站）。在向该等第三方提供您的个人资料前（不论是否通过本网站），请查阅该等第三方的隐私政策，对于该等第三方使用或违反您的个人资料，我们并不对此负责或承担任何责任。<br />
我们保留在任何时间，非经对网站任何用户的通知，而修改或更新此政策或其他任何政策或实践措施的权利。任何修改或更新一经登载于网站上即开始生效。
              </pre>
          </div>
          <!-- word-space end -->

        </div>
    </div>
</div>
	`, data: function () {
        return {

        };
    }, beforeRouteEnter(to, from, next) {
        //当组件加载时自动调用此函数 函数结尾必须next();
        document.title = "安全和隐私";
        next();
    }, created() {
        //组件加载完成会自动调用此方法
        window.scrollTo(0,0);
    }, methods: {


    }
}